{
  "_name_or_path": "lener_bert/",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PESSOA",
    "2": "I-PESSOA",
    "3": "B-JURISPRUDENCIA",
    "4": "B-LEGISLACAO",
    "5": "B-TEMPO",
    "6": "B-LOCAL",
    "7": "I-LOCAL",
    "8": "I-LEGISLACAO",
    "9": "B-ORGANIZACAO",
    "10": "I-ORGANIZACAO",
    "11": "I-JURISPRUDENCIA",
    "12": "I-TEMPO"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-JURISPRUDENCIA": 3,
    "B-LEGISLACAO": 4,
    "B-LOCAL": 6,
    "B-ORGANIZACAO": 9,
    "B-PESSOA": 1,
    "B-TEMPO": 5,
    "I-JURISPRUDENCIA": 11,
    "I-LEGISLACAO": 8,
    "I-LOCAL": 7,
    "I-ORGANIZACAO": 10,
    "I-PESSOA": 2,
    "I-TEMPO": 12,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.35.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29794
}
